ERP DEV.WMS/src/Catalogs/вмс_Контейнеры/вмс_Контейнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_Контейнеры</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТипТары</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ТипыКонтейнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.вмс_ВидыПартийТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПартии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОснования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Вскрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_Контейнеры/Forms/ФормаГенерацииКонтейнеров/Module.bsl
//ТУ_Августинович ++ 24.04.2026
// - Генерируем контейнеры через метод СоздатьКонтейнеры из модуля менеджера справочника вмс_Контейнеры

&НаСервере
Функция СгенерироватьНаСервере_Старая(ТипКонтейнера, КоличествоКонтейнеров)  
	
	РезультатМетода = Справочники.вмс_Контейнеры.ПолучитьМассивУникальныхИдентификаторов(КоличествоКонтейнеров);
	МассивКонтейнеров = Новый Массив;    
	Префикс = СтрЗаменить(ТипКонтейнера.Префикс,"_","");  
	ДатаГенерации = Формат(ТекущаяДата(), "ДФ=ddMMyymmss");
	Счетчик = 1;
	ПервыйСимвол = Лев(Строка(ТипКонтейнера),1) + "_";
	Если РезультатМетода.Результат = Истина Тогда   
		
		Для Каждого УИСтрока ИЗ РезультатМетода.Данные Цикл                     
			
			НовыйКонтейнер = Справочники.вмс_Контейнеры.СоздатьЭлемент();
			НовыйКонтейнер.Заполнить(Неопределено);
			НовыйКонтейнер.УстановитьСсылкуНового(Справочники.вмс_Контейнеры.ПолучитьСсылку(УИСтрока.УникальныйИдентификатор));
			НовыйКонтейнер.ТипТары = ТипКонтейнера;
			НовыйКонтейнер.Штрихкод = ?(УИСтрока.Наименование = "",Префикс + УИСтрока.УникальныйИдентификатор,УИСтрока.Наименование);
			//Если ЕстьОснование Тогда
			//	НовыйКонтейнер.ИдентификаторОснования = ДокументОснование.GUID;
			//	НовыйКонтейнер.ОснованиеСтрокой = ДокументОснование.ИмяТипа;
			//	Попытка
			//		НовыйКонтейнер.Распоряжение = ДокументОснование;	
			//	Исключение
			//	    //ОписаниеОшибки()
			//	КонецПопытки;
			//КонецЕсли;			
			НовыйКонтейнер.Наименование = ?(УИСтрока.Наименование = "",ПервыйСимвол+ ДатаГенерации + "_" + Строка(Счетчик) + " (" + ТипКонтейнера + ")",УИСтрока.Наименование); 			
			НовыйКонтейнер.Записать();     
			
			МассивКонтейнеров.Добавить(НовыйКонтейнер.Ссылка);
			Счетчик = Счетчик + 1;
		КонецЦикла;  
		Возврат МассивКонтейнеров;
	Иначе
		Ошибка = РезультатМетода.Данные;
	КонецЕсли;
	
КонецФункции


&НаСервере
Функция СгенерироватьНаСервере(ТипКонтейнера, КоличествоКонтейнеров)
	МассивКонтейнеров = Новый Массив;
	
	ДокументОснование = ЭтаФорма.Распоряжение;
	
	ДанныеЗаполнения = Справочники.вмс_Контейнеры.НовыеПараметрыСозданияКонтейнеров();
	ДанныеЗаполнения.ТипКонтейнера	= ТипКонтейнера;
	ДанныеЗаполнения.Количество		= КоличествоКонтейнеров;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ДанныеЗаполнения.Распоряжение	= ДокументОснование;
		ДанныеЗаполнения.Контрагент		= ДокументОснование.Контрагент;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивКонтейнеров, Справочники.вмс_Контейнеры.СоздатьКонтейнеры(ДанныеЗаполнения));
	
	Возврат МассивКонтейнеров;
КонецФункции
//ТУ_Августинович -- 24.04.2026

&НаКлиенте
Процедура Сгенерировать(Команда) 
	
	// ТУ_Кулалаев Е.С ++ 31.05.2024 17:59:26 
	// Рефакторинг: Заменил вмс_Печать на вмс_Печать
	
	
	Если НЕ ЗначениеЗаполнено(ТипКонтейнера) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберите тип контейнера";
		Сообщение.Сообщить();   
		Возврат;
	КонецЕсли;
	Если КоличествоКонтейнеров <= 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Введите количество создаваемых контейнеров";
		Сообщение.Сообщить();	
		Возврат;
	КонецЕсли;
	
	МассивДокументов = СгенерироватьНаСервере(ТипКонтейнера, КоличествоКонтейнеров) ;
	Если ЗначениеЗаполнено(МассивДокументов) Тогда    
		Результат = вмс_Печать.СформироватьТабличныйДокументЭтикеткиКонтейнеров(МассивДокументов);
		Результат.Показать();
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры
